; domain
(define (domain planeWorld)
  (:requirements :strips :typing)
  (:types plane cargo airport)
  (:predicates
    (vide ?x - plane)
    (situeP ?x - plane ?y - airport)
    (situeC ?x - cargo ?y - airport)
    (dans ?x - cargo ?y - plane)
    )
  (:action charger
  ;;; action qui charge une cargaison x dans un avion y situé à l'aéroport z
  :parameters (?x - cargo ?y - plane ?z - airport)
  :precondition (and (vide ?y)
                (situeC ?x ?z)
                (situeP ?y ?z))
  :effect (and (dans ?x ?y)
          (not (vide ?y))
          (not (situeC ?x ?z)))
  )
  (:action decharger
  ;;; action qui decharge une cargaison x se trouvant dans un avion y à l'aéroport z
  :parameters (?x - cargo ?y - plane ?z - airport)
  :precondition (and (dans ?x ?y) 
                     (situeP ?y ?z))
  :effect (and (vide ?y)
          (situeC ?x ?z)
          (not (dans ?x ?y)))
  )
  (:action voler
  ;;; action qui fait voler un avion x de l'aéroport y à l'aéroport z
  :parameters (?x - plane ?y - airport ?z - airport)
  :precondition (situeP ?x ?y)
  :effect (and (situeP ?x ?z)
          (not (situeP ?x ?y)))
  )
)

; problem
(define (problem planeProblem)
  (:domain planeWorld)
  (:objects C1 C2 C3 - cargo A1 A2 - plane TEG CDG BAR -airport)
  (:init (situeC C1 TEG) 
         (situeC C2 TEG)
         (situeC C3 TEG)
         (situeP A1 TEG)
         (situeP A2 TEG)
         (vide A1)
         (vide A2)
  )
  (:goal (and (situeC C1 BAR) 
         (situeC C2 BAR)
         (situeC C3 BAR)
         (situeP A1 CDG)
         (situeP A2 CDG)))
  )

; plan
1. (charger c1 a2 teg)
   deleted: (vide a2) (situec c1 teg)
   added: (dans c1 a2)
   goals met: 0 of 5
2. (charger c3 a1 teg)
   deleted: (vide a1) (situec c3 teg)
   added: (dans c3 a1)
   goals met: 0 of 5
3. (voler a2 teg bar)
   deleted: (situep a2 teg)
   added: (situep a2 bar)
   goals met: 0 of 5
4. (decharger c1 a2 bar)
   deleted: (dans c1 a2)
   added: (vide a2) (situec c1 bar)
   goals met: 1 of 5
5. (voler a1 teg bar)
   deleted: (situep a1 teg)
   added: (situep a1 bar)
   goals met: 1 of 5
6. (voler a2 bar teg)
   deleted: (situep a2 bar)
   added: (situep a2 teg)
   goals met: 1 of 5
7. (decharger c3 a1 bar)
   deleted: (dans c3 a1)
   added: (vide a1) (situec c3 bar)
   goals met: 2 of 5
8. (voler a1 bar teg)
   deleted: (situep a1 bar)
   added: (situep a1 teg)
   goals met: 2 of 5
9. (charger c2 a2 teg)
   deleted: (vide a2) (situec c2 teg)
   added: (dans c2 a2)
   goals met: 2 of 5
10. (voler a1 teg cdg)
   deleted: (situep a1 teg)
   added: (situep a1 cdg)
   goals met: 3 of 5
11. (voler a2 teg bar)
   deleted: (situep a2 teg)
   added: (situep a2 bar)
   goals met: 3 of 5
12. (decharger c2 a2 bar)
   deleted: (dans c2 a2)
   added: (vide a2) (situec c2 bar)
   goals met: 4 of 5
13. (voler a2 bar cdg)
   deleted: (situep a2 bar)
   added: (situep a2 cdg)
   goals met: 5 of 5
